jorgebucaran/fisher
jorgebucaran/spark.fish
acomagu/fish-async-prompt
jethrokuan/z
franciscolourenco/done
cyber-duck/fish-wakatime
jorgebucaran/autopair.fish
kama-meshi/fish-wakatime
