tap "goles/battery"
tap "homebrew/bundle"
tap "homebrew/core"

brew "bat"
brew "bats-core"
brew "berkeley-db"
brew "cmake"
brew "coreutils"
brew "croc"
brew "diff-so-fancy"
# brew "difftastic"
brew "docker"
brew "dockutil"
brew "dpkg"
brew "fasd"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "gnu-sed"
brew "goles/battery/battery"
brew "grep"
brew "grip"
brew "hello"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "links"
brew "lynx"
brew "mackup"
brew "make"
brew "midnight-commander"
brew "nano"
brew "ncdu"
brew "pandoc"
brew "peco"
brew "psgrep"
# brew "python"
brew "python-tk@3.10"
brew "python@3.10"
brew "rust"
brew "shellcheck"
brew "ssh-copy-id"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unar"
brew "util-linux"
brew "webp"
brew "wget"
brew "youtube-dl"
brew "zsh"
