# Homebrew Packages (WIP)

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "stripe/stripe-cli"
tap "goles/battery"

# Formulae
brew "asciinema"
brew "bat"
brew "bats-core"
brew "berkeley-db"
brew "cmake"
brew "crystal"
brew "coreutils"
brew "croc"
brew "diff-so-fancy"
# brew "difftastic"
brew "docker"
brew "dockutil"
brew "dpkg"
brew "fasd"
brew "fnm"
brew "fish"
brew "feh"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "xdotool"
brew "gnu-sed"
brew "svn"
brew "hub"
brew "goles/battery/battery"
brew "grep"
brew "grip"
brew "hello"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "links"
brew "lynx"
brew "mackup"
brew "make"
brew "mysql"
brew "mesa"
brew "midnight-commander"
brew "nano"
brew "nodenv"
brew "nmap"
brew "ncdu"
brew "nginx"
brew "pandoc"
brew "peco"
brew "psgrep"
# brew "python"
# brew "python-tk@3.10"
# brew "python@3.10"
brew "pyenv"
brew "rbenv"
brew "rust"
brew "shellcheck"
brew "spotify-tui"
brew "starship"
brew "ssh-copy-id"
brew "subversion"
brew "stow"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unrar"
brew "util-linux"
brew "webp"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"

# Cask
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "nicoverbruggen/homebrew-cask"

# Apps
cask "1password"
cask "caffeine"
cask "camo-studio"
cask "dbngin"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "github"
cask "google-chrome"
cask "google-chrome-canary"
cask "gpg-suite"
cask "hammerspoon"
cask "helo"
cask "homebrew/cask-drivers/elgato-stream-deck"
cask "imageoptim"
cask "insomnia"
cask "kaleidoscope2"
cask "pastebot"
cask "phpmon"
cask "phpstorm"
cask "postman"
cask "ray"
cask "raycast"
cask "screenflow"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "the-unarchiver"
cask "tinkerwell"
cask "transmit"
cask "tunnelbear"
cask "tuple"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask "font-lato"
cask "font-hack"
cask "font-roboto"
cask "font-fira-code"
cask "font-open-sans"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"